### Cleaning overview file

In [2]:
import pandas as pd

In [3]:

Natgas_overview = pd.read_csv("/Users/richardlesko/Desktop/Data Processing in Python/GitHub - Natural Gas/Python-Final-Project-Natural-gas-price-analysis-/data/raw/EIA_T04_01_Natural_Gas_Overview_Monthly.csv")
Natgas_overview.head()

,MSN,YYYYMM,Value,Column_Order,Description,Unit
0,NGGWPUS,194913,7546.825,1,Natural Gas Gross Withdrawals,Billion Cubic Feet
1,NGGWPUS,195013,8479.65,1,Natural Gas Gross Withdrawals,Billion Cubic Feet
2,NGGWPUS,195113,9689.372,1,Natural Gas Gross Withdrawals,Billion Cubic Feet
3,NGGWPUS,195213,10272.566,1,Natural Gas Gross Withdrawals,Billion Cubic Feet
4,NGGWPUS,195313,10645.798,1,Natural Gas Gross Withdrawals,Billion Cubic Feet

In [4]:
Natgas_overview["year"] = Natgas_overview["YYYYMM"] // 100
Natgas_overview["month"] = Natgas_overview["YYYYMM"] % 100

In [5]:
Natgas_overview.head()

,MSN,YYYYMM,Value,Column_Order,Description,Unit,year,month
0,NGGWPUS,194913,7546.825,1,Natural Gas Gross Withdrawals,Billion Cubic Feet,1949,13
1,NGGWPUS,195013,8479.65,1,Natural Gas Gross Withdrawals,Billion Cubic Feet,1950,13
2,NGGWPUS,195113,9689.372,1,Natural Gas Gross Withdrawals,Billion Cubic Feet,1951,13
3,NGGWPUS,195213,10272.566,1,Natural Gas Gross Withdrawals,Billion Cubic Feet,1952,13
4,NGGWPUS,195313,10645.798,1,Natural Gas Gross Withdrawals,Billion Cubic Feet,1953,13

In [6]:
Natgas_overview["month"] = Natgas_overview["YYYYMM"] % 100
Natgas_overview = Natgas_overview[Natgas_overview["month"] <= 12]

In [7]:
Natgas_overview.head()

,MSN,YYYYMM,Value,Column_Order,Description,Unit,year,month
24,NGGWPUS,197301,Not Available,1,Natural Gas Gross Withdrawals,Billion Cubic Feet,1973,1
25,NGGWPUS,197302,Not Available,1,Natural Gas Gross Withdrawals,Billion Cubic Feet,1973,2
26,NGGWPUS,197303,Not Available,1,Natural Gas Gross Withdrawals,Billion Cubic Feet,1973,3
27,NGGWPUS,197304,Not Available,1,Natural Gas Gross Withdrawals,Billion Cubic Feet,1973,4
28,NGGWPUS,197305,Not Available,1,Natural Gas Gross Withdrawals,Billion Cubic Feet,1973,5

In [8]:
Natgas_overview["year_month"] = Natgas_overview["YYYYMM"]
Natgas_overview.head()

,MSN,YYYYMM,Value,Column_Order,Description,Unit,year,month,year_month
24,NGGWPUS,197301,Not Available,1,Natural Gas Gross Withdrawals,Billion Cubic Feet,1973,1,197301
25,NGGWPUS,197302,Not Available,1,Natural Gas Gross Withdrawals,Billion Cubic Feet,1973,2,197302
26,NGGWPUS,197303,Not Available,1,Natural Gas Gross Withdrawals,Billion Cubic Feet,1973,3,197303
27,NGGWPUS,197304,Not Available,1,Natural Gas Gross Withdrawals,Billion Cubic Feet,1973,4,197304
28,NGGWPUS,197305,Not Available,1,Natural Gas Gross Withdrawals,Billion Cubic Feet,1973,5,197305

In [9]:
Natgas_overview = Natgas_overview.drop(columns=["year", "month", "year_month", "MSN", "Unit"])
Natgas_overview.head()

    YYYYMM          Value  Column_Order                    Description
24  197301  Not Available             1  Natural Gas Gross Withdrawals
25  197302  Not Available             1  Natural Gas Gross Withdrawals
26  197303  Not Available             1  Natural Gas Gross Withdrawals
27  197304  Not Available             1  Natural Gas Gross Withdrawals
28  197305  Not Available             1  Natural Gas Gross Withdrawals

In [11]:
Natgas_overview = Natgas_overview[Natgas_overview["Value"] != "Not Available"]
Natgas_overview.head()

     YYYYMM Value  Column_Order                    Description
115  198001  1960             1  Natural Gas Gross Withdrawals
116  198002  1840             1  Natural Gas Gross Withdrawals
117  198003  1971             1  Natural Gas Gross Withdrawals
118  198004  1806             1  Natural Gas Gross Withdrawals
119  198005  1840             1  Natural Gas Gross Withdrawals

In [ ]:

Natgas_overview_pivot = Natgas_overview.pivot(index='YYYYMM', columns='Description', values='Value')


desc_order = Natgas_overview[['Description', 'Column_Order']].drop_duplicates().sort_values('Column_Order')
ordered_columns = desc_order['Description'].tolist()


Natgas_overview_pivot = Natgas_overview_pivot[ordered_columns]


Natgas_overview_pivot.reset_index(inplace=True)

print(Natgas_overview_pivot.head())

Description  YYYYMM Natural Gas Gross Withdrawals  \
0            197301                           NaN
1            197302                           NaN
2            197303                           NaN
3            197304                           NaN
4            197305                           NaN

Description Natural Gas Marketed Production (Wet) NGPL Production  \
0                                            1948              79
1                                            1962              79
2                                            1907              77
3                                            1814              73
4                                            1898              77

Description Natural Gas Production (Dry) Supplemental Gaseous Fuels  \
0                                   1869                        NaN
1                                   1883                        NaN
2                                   1830                        NaN
3                                   1741                        NaN
4                                   1821                        NaN

Description Natural Gas Imports Natural Gas Exports Natural Gas Net Imports  \
0                        92.694               5.808                  86.887
1                         83.87               6.079                  77.791
2                        91.581               4.021                   87.56
3                        88.407               8.017                   80.39
4                        85.844               8.741                  77.103

Description Natural Gas Net Storage Withdrawals Natural Gas Balancing Item  \
0                                           NaN                        NaN
1                                           NaN                        NaN
2                                           NaN                        NaN
3                                           NaN                        NaN
4                                           NaN                        NaN

Description Natural Gas Consumption
0                              2348
1                              2126
2                              2015
3                              1835
4                              1729

In [18]:
Natgas_overview_pivot.to_csv(
    "/Users/richardlesko/Desktop/Data Processing in Python/GitHub - Natural Gas/Python-Final-Project-Natural-gas-price-analysis-/data/processed/Natgas_overview_monthly_processed.csv",
    index=False
)

### Cleaning HDD file

In [37]:
import pandas as pd

hdd = pd.read_csv("/Users/richardlesko/Desktop/Data Processing in Python/GitHub - Natural Gas/Python-Final-Project-Natural-gas-price-analysis-/data/raw/EIA_T01_11_HDD_by_CensusDivision.csv")
hdd.head()

,MSN,YYYYMM,Value,Column_Order,Description,Unit
0,ZWHDPC1,194913,6148,1,"Heating Degree-Days, New England",Number
1,ZWHDPC1,195013,6793,1,"Heating Degree-Days, New England",Number
2,ZWHDPC1,195113,6476,1,"Heating Degree-Days, New England",Number
3,ZWHDPC1,195213,6500,1,"Heating Degree-Days, New England",Number
4,ZWHDPC1,195313,5945,1,"Heating Degree-Days, New England",Number

In [38]:
hdd = hdd[hdd["Description"] == "Heating Degree-Days, United States"]
hdd.head()

,MSN,YYYYMM,Value,Column_Order,Description,Unit
6381,ZWHDPUS,194913,4933,10,"Heating Degree-Days, United States",Number
6382,ZWHDPUS,195013,5362,10,"Heating Degree-Days, United States",Number
6383,ZWHDPUS,195113,5310,10,"Heating Degree-Days, United States",Number
6384,ZWHDPUS,195213,5082,10,"Heating Degree-Days, United States",Number
6385,ZWHDPUS,195313,4747,10,"Heating Degree-Days, United States",Number

In [39]:
hdd["month"] = hdd["YYYYMM"] % 100
hdd = hdd[hdd["month"] <= 12]
hdd.head()

,MSN,YYYYMM,Value,Column_Order,Description,Unit,month
6405,ZWHDPUS,197301,964,10,"Heating Degree-Days, United States",Number,1
6406,ZWHDPUS,197302,842,10,"Heating Degree-Days, United States",Number,2
6407,ZWHDPUS,197303,552,10,"Heating Degree-Days, United States",Number,3
6408,ZWHDPUS,197304,401,10,"Heating Degree-Days, United States",Number,4
6409,ZWHDPUS,197305,214,10,"Heating Degree-Days, United States",Number,5

In [40]:
hdd["year_month"] = hdd["YYYYMM"]
hdd.head()

,MSN,YYYYMM,Value,Column_Order,Description,Unit,month,year_month
6405,ZWHDPUS,197301,964,10,"Heating Degree-Days, United States",Number,1,197301
6406,ZWHDPUS,197302,842,10,"Heating Degree-Days, United States",Number,2,197302
6407,ZWHDPUS,197303,552,10,"Heating Degree-Days, United States",Number,3,197303
6408,ZWHDPUS,197304,401,10,"Heating Degree-Days, United States",Number,4,197304
6409,ZWHDPUS,197305,214,10,"Heating Degree-Days, United States",Number,5,197305

In [41]:
hdd = hdd[["year_month", "Value"]]
hdd.head()

      year_month  Value
6405      197301    964
6406      197302    842
6407      197303    552
6408      197304    401
6409      197305    214

In [42]:
hdd = hdd.rename(columns={"Value": "HDD"})
hdd.head()

      year_month  HDD
6405      197301  964
6406      197302  842
6407      197303  552
6408      197304  401
6409      197305  214

In [43]:
hdd.to_csv(
    "/Users/richardlesko/Desktop/Data Processing in Python/GitHub - Natural Gas/Python-Final-Project-Natural-gas-price-analysis-/data/processed/hdd_processed.csv",
    index=False
)

### CDD cleaning

In [44]:
import pandas as pd

cdd = pd.read_csv("/Users/richardlesko/Desktop/Data Processing in Python/GitHub - Natural Gas/Python-Final-Project-Natural-gas-price-analysis-/data/raw/EIA_T01_12_CDD_by_CensusDivision.csv")
cdd.head()

,MSN,YYYYMM,Value,Column_Order,Description,Unit
0,ZWCDPC1,194913,572,1,"Cooling Degree-Days, New England",Number
1,ZWCDPC1,195013,296,1,"Cooling Degree-Days, New England",Number
2,ZWCDPC1,195113,326,1,"Cooling Degree-Days, New England",Number
3,ZWCDPC1,195213,503,1,"Cooling Degree-Days, New England",Number
4,ZWCDPC1,195313,372,1,"Cooling Degree-Days, New England",Number

In [45]:
cdd = cdd[cdd["Description"] == "Cooling Degree-Days, United States"]
cdd.head()

,MSN,YYYYMM,Value,Column_Order,Description,Unit
6381,ZWCDPUS,194913,1103,10,"Cooling Degree-Days, United States",Number
6382,ZWCDPUS,195013,873,10,"Cooling Degree-Days, United States",Number
6383,ZWCDPUS,195113,975,10,"Cooling Degree-Days, United States",Number
6384,ZWCDPUS,195213,1111,10,"Cooling Degree-Days, United States",Number
6385,ZWCDPUS,195313,1108,10,"Cooling Degree-Days, United States",Number

In [47]:
cdd["month"] = cdd["YYYYMM"] % 100
cdd = cdd[cdd["month"] <= 12]
cdd.head()

,MSN,YYYYMM,Value,Column_Order,Description,Unit,month
6405,ZWCDPUS,197301,5,10,"Cooling Degree-Days, United States",Number,1
6406,ZWCDPUS,197302,3,10,"Cooling Degree-Days, United States",Number,2
6407,ZWCDPUS,197303,19,10,"Cooling Degree-Days, United States",Number,3
6408,ZWCDPUS,197304,13,10,"Cooling Degree-Days, United States",Number,4
6409,ZWCDPUS,197305,62,10,"Cooling Degree-Days, United States",Number,5

In [48]:
cdd["year_month"] = cdd["YYYYMM"]
cdd.head()

,MSN,YYYYMM,Value,Column_Order,Description,Unit,month,year_month
6405,ZWCDPUS,197301,5,10,"Cooling Degree-Days, United States",Number,1,197301
6406,ZWCDPUS,197302,3,10,"Cooling Degree-Days, United States",Number,2,197302
6407,ZWCDPUS,197303,19,10,"Cooling Degree-Days, United States",Number,3,197303
6408,ZWCDPUS,197304,13,10,"Cooling Degree-Days, United States",Number,4,197304
6409,ZWCDPUS,197305,62,10,"Cooling Degree-Days, United States",Number,5,197305

In [49]:
cdd = cdd[["year_month", "Value"]]
cdd.head()

      year_month  Value
6405      197301      5
6406      197302      3
6407      197303     19
6408      197304     13
6409      197305     62

In [ ]:
cdd = cdd.rename(columns={"Value": "CDD"})
cdd.head()

      year_month  HDD
6405      197301    5
6406      197302    3
6407      197303   19
6408      197304   13
6409      197305   62

In [51]:
cdd.to_csv(
    "/Users/richardlesko/Desktop/Data Processing in Python/GitHub - Natural Gas/Python-Final-Project-Natural-gas-price-analysis-/data/processed/cdd_processed.csv",
    index=False
)

In [ ]:
### converting weekly natgas prices to monthly prices

In [53]:


henryhub_weekly_clean = pd.read_csv(
    "/Users/richardlesko/Desktop/Data Processing in Python/GitHub - Natural Gas/Python-Final-Project-Natural-gas-price-analysis-/data/processed/henryhub_weekly_clean.csv"
)

henryhub_weekly_clean.head()

                 week_of   mon   tue   wed   thu   fri  week_start
0  1997 Jan- 6 to Jan-10   NaN  3.82  3.80  3.61  3.92  1997-01-06
1  1997 Jan-13 to Jan-17  4.00  4.01  4.34  4.71  3.91  1997-01-13
2  1997 Jan-20 to Jan-24  3.26  2.99  3.05  2.96  2.62  1997-01-20
3  1997 Jan-27 to Jan-31  2.98  3.05  2.91  2.86  2.77  1997-01-27
4  1997 Feb- 3 to Feb- 7  2.49  2.59  2.65  2.51  2.39  1997-02-03

In [58]:

daily_cols = ['mon', 'tue', 'wed', 'thu', 'fri']
henryhub_weekly_clean[daily_cols] = henryhub_weekly_clean[daily_cols].apply(pd.to_numeric, errors='coerce')
henryhub_weekly_clean['weekly_avg'] = henryhub_weekly_clean[daily_cols].mean(axis=1, skipna=True)


henryhub_weekly_clean['week_start'] = pd.to_datetime(henryhub_weekly_clean['week_start'])
henryhub_weekly_clean['year'] = henryhub_weekly_clean['week_start'].dt.year
henryhub_weekly_clean['month'] = henryhub_weekly_clean['week_start'].dt.month
henryhub_weekly_clean['year_month'] = henryhub_weekly_clean['week_start'].dt.year * 100 + henryhub_weekly_clean['week_start'].dt.month

henryhub_monthly = henryhub_weekly_clean.groupby('year_month')['weekly_avg'].mean().reset_index()
henryhub_monthly.rename(columns={'weekly_avg': 'monthly_avg_price'}, inplace=True)

print(henryhub_monthly.head())

   year_month  monthly_avg_price
0      199701           3.467875
1      199702           2.138375
2      199703           1.889000
3      199704           2.077000
4      199705           2.254875

In [59]:
henryhub_monthly.to_csv(
    "/Users/richardlesko/Desktop/Data Processing in Python/GitHub - Natural Gas/Python-Final-Project-Natural-gas-price-analysis-/data/processed/henryhub_monthly.csv",
    index=False
)

### merging dataset